GojuonTranslateInitialize()
{
    gojuon_list_json =
    (LTrim
        {
             "a": ["あ", "ア"],  "i": ["い", "イ"],  "u": ["う", "ウ"],  "e": ["え", "エ"],  "o": ["お", "オ"],
            "ka": ["か", "カ"], "ki": ["き", "キ"], "ku": ["く", "ク"], "ke": ["け", "ケ"], "ko": ["こ", "コ"],
            "sa": ["さ", "サ"], "si": ["し", "シ"], "su": ["す", "ス"], "se": ["せ", "セ"], "so": ["そ", "ソ"],
            "ta": ["た", "タ"], "ti": ["ち", "チ"], "tu": ["つ", "ツ"], "te": ["て", "テ"], "to": ["と", "ト"],
            "na": ["な", "ナ"], "ni": ["に", "ニ"], "nu": ["ぬ", "ヌ"], "ne": ["ね", "ネ"], "no": ["の", "ノ"],
            "ha": ["は", "ハ"], "hi": ["ひ", "ヒ"], "hu": ["ふ", "フ"], "he": ["へ", "ヘ"], "ho": ["ほ", "ホ"],
            "ma": ["ま", "マ"], "mi": ["み", "ミ"], "mu": ["む", "ム"], "me": ["め", "メ"], "mo": ["も", "モ"],
            "ya": ["や", "ヤ"],                     "yu": ["ゆ", "ユ"], "ye": ["𛀁", ""  ], "yo": ["よ", "ヨ"],
            "ra": ["ら", "ラ"], "ri": ["り", "リ"], "ru": ["る", "ル"], "re": ["れ", "レ"], "ro": ["ろ", "ロ"],
            "wa": ["わ", "ワ"], "wi": ["ゐ", "ヰ"],                     "we": ["ゑ", "ヱ"], "wo": ["を", "ヲ"],
             "n": ["ん", "ン"], "nn": ["ん", "ン"],
           "shi": ["し", "シ"],"tsu": ["つ", "ツ"],"chi": ["ち", "チ"],
            
            "ga": ["が", "ガ"], "gi": ["ぎ", "ギ"], "gu": ["ぐ", "グ"], "ge": ["げ", "ゲ"], "go": ["ご", "ゴ"],
            "za": ["ざ", "ザ"], "ji": ["じ", "ジ"], "zu": ["ず", "ズ"], "ze": ["ぜ", "ゼ"], "zo": ["ぞ", "ゾ"],
            "da": ["だ", "ダ"], "di": ["ぢ", "ヂ"], "du": ["づ", "ヅ"], "de": ["で", "デ"], "do": ["ど", "ド"], 
            "ba": ["ば", "バ"], "bi": ["び", "ビ"], "bu": ["ぶ", "ブ"], "be": ["べ", "ベ"], "bo": ["ぼ", "ボ"],
            "pa": ["ぱ", "パ"], "pi": ["ぴ", "ピ"], "pu": ["ぷ", "プ"], "pe": ["ぺ", "ペ"], "po": ["ぽ", "ポ"],
            "zi": ["ぢ", "ヂ"],

             "k": ["っ", "ッ"],  "s": ["っ", "ッ"],  "t": ["っ", "ッ"],
             "h": ["っ", "ッ"],  "f": ["っ", "ッ"], "m": ["っ", "ッ"],  "y": ["っ", "ッ"],
             "r": ["っ", "ッ"],  "g": ["っ", "ッ"],  "z": ["っ", "ッ"],
             "d": ["っ", "ッ"],  "b": ["っ", "ッ"],  "p": ["っ", "ッ"],
             "c": ["っ", "ッ"],  "l": ["っ", "ッ"],  "x": ["っ", "ッ"],

            "fa": ["ふぁ", "ファ"],
            "fi": ["ふぃ", "フィ"],
            "fu": ["ふ",   "フ"],
            "fe": ["ふぇ", "フェ"],
            "fo": ["ふぉ", "フォ"],

            "la": ["ぁ", "ァ"], "li": ["ぃ", "ィ"], "lu": ["ぅ", "ゥ"], "le": ["ぇ", "ェ"], "lo": ["ぉ", "ォ"],
           "lka": ["ゕ", "ヵ"],                    "lku": ["ㇰ", ""  ],"lke": ["ゖ", "ヶ"],
                               "lsi": ["ㇱ", ""  ],"lsu": ["ㇲ", ""  ],
                                                   "ltu": ["っ", "ッ"],                    "lto": ["ㇳ", ""  ],
                                                   "lnu": ["ㇴ", ""  ],
           "lha": ["ㇵ", ""  ],"lhi": ["ㇶ", ""  ],"lfu": ["ㇷ", ""  ],"lfe": ["ㇸ", ""  ],"lfo": ["ㇹ", ""  ],
                                                   "lmu": ["ㇺ", ""  ],
           "lya": ["ゃ", "ャ"],                    "lyu": ["ゅ", "ュ"],                    "lyo": ["ょ", "ョ"],
           "lra": ["ㇻ", ""  ],"lri": ["ㇼ", ""  ],"lru": ["ㇽ", ""  ],"lre": ["ㇾ", ""  ],"lro": ["ㇿ", ""  ],
           "lwa": ["ゎ", "ヮ"],"lpu": ["ㇷ゚", ""  ],
           "lshi": ["ㇱ", ""  ],"ltsu": ["っ", "ッ"],

            "xa": ["ぁ", "ァ"], "xi": ["ぃ", "ィ"], "xu": ["ぅ", "ゥ"], "xe": ["ぇ", "ェ"], "xo": ["ぉ", "ォ"],
           "xka": ["ゕ", "ヵ"],                    "xku": ["ㇰ", ""  ],"xke": ["ゖ", "ヶ"],
                               "xsi": ["ㇱ", ""  ],"xsu": ["ㇲ", ""  ],
                                                   "xtu": ["っ", "ッ"],                    "xto": ["ㇳ", ""  ],
                                                   "xnu": ["ㇴ", ""  ],
           "xha": ["ㇵ", ""  ],"xhi": ["ㇶ", ""  ],"xfu": ["ㇷ", ""  ],"xfe": ["ㇸ", ""  ],"xfo": ["ㇹ", ""  ],
                                                   "xmu": ["ㇺ", ""  ],
           "xya": ["ゃ", "ャ"],                    "xyu": ["ゅ", "ュ"],                    "xyo": ["ょ", "ョ"],
           "xra": ["ㇻ", ""  ],"xri": ["ㇼ", ""  ],"xru": ["ㇽ", ""  ],"xre": ["ㇾ", ""  ],"xro": ["ㇿ", ""  ],
           "xwa": ["ゎ", "ヮ"],"xpu": ["ㇷ゚", ""  ],
           "xshi": ["ㇱ", ""  ],"xtsu": ["っ", "ッ"],


            "kya": ["きゃ", "キャ"], "kyu": ["きゅ", "キュ"], "kyo": ["きょ", "キョ"],
            "sha": ["しゃ", "シャ"], "shu": ["しゅ", "シュ"], "sho": ["しょ", "ショ"],
            "cha": ["ちゃ", "チャ"], "chu": ["ちゅ", "チュ"], "cho": ["ちょ", "チョ"],
            "sya": ["しゃ", "シャ"], "syu": ["しゅ", "シュ"], "syo": ["しょ", "ショ"],
            "cya": ["ちゃ", "チャ"], "cyu": ["ちゅ", "チュ"], "cyo": ["ちょ", "チョ"],
            "nya": ["にゃ", "ニャ"], "nyu": ["にゅ", "ニュ"], "nyo": ["にょ", "ニョ"],
            "hya": ["ひゃ", "ヒャ"], "hyu": ["ひゅ", "ヒュ"], "hyo": ["ひょ", "ヒョ"],
            "mya": ["みゃ", "ミャ"], "myu": ["みゅ", "ミュ"], "myo": ["みょ", "ミョ"],
            "rya": ["りゃ", "リャ"], "ryu": ["りゅ", "リュ"], "ryo": ["りょ", "リョ"],
            "gya": ["ぎゃ", "ギャ"], "gyu": ["ぎゅ", "ギュ"], "gyo": ["ぎょ", "ギョ"],
            "zya": ["じゃ", "ジャ"], "zyu": ["じゅ", "ジュ"], "zyo": ["じょ", "ジョ"],
            "dya": ["ぢゃ", "ヂャ"], "dyu": ["ぢゅ", "ヂュ"], "dyo": ["ぢょ", "ヂョ"],
            "bya": ["びゃ", "ビャ"], "byu": ["びゅ", "ビュ"], "byo": ["びょ", "ビョ"],
            "pya": ["ぴゃ", "ピャ"], "pyu": ["ぴゅ", "ピュ"], "pyo": ["ぴょ", "ピョ"],
             "ja": ["じゃ", "ジャ"],  "ju": ["じゅ", "ジュ"],  "jo": ["じょ", "ジョ"],
            "jya": ["じゃ", "ジャ"], "jyu": ["じゅ", "ジュ"], "jyo": ["じょ", "ジョ"],

            "-": ["ー", "ー"]
        }
    )
    global ime_gojuon_list := JSON.Load(gojuon_list_json)
}

GojuonTranslateFindResult(splitter_result, auto_complete)
{
    global ime_gojuon_list

    splitted_string := SplitterResultGetPinyin(splitter_result[1])
    if( ime_gojuon_list.HasKey(splitted_string) )
    {
        gojuon := ime_gojuon_list[splitted_string]
        translate_result_list := [TranslatorResultMake(splitted_string, gojuon[1], 0, "", 1, splitted_string) 
            ,TranslatorResultMake(splitted_string, gojuon[2], 1, "", 1, splitted_string)]
    }
    else
    {
        translate_result_list := [TranslatorResultMake(splitted_string, splitted_string, 1, "", 1, splitted_string)]
    }

    return translate_result_list
}
